Repository: jrajaniemi/BikeComputerSwiftUI
Catalog: BikeComputer/Components/Localizable.xcstrings
Source language: en
Languages: ar, bg, bs, ca, cs, da, de, el, es, et, fi, fr, ga, ga_ie, ha, he, hi, hr, hu, hy, id, is, it, ja, ka, ko, ku, la, lt, lv, mk, ms, mt, nb, nl, pa, pl, pt, pt_pt, qu, rm, rm_ch, ro, ru, sk, sl, sq, sr, sv, sw, th, tr, uk_ua, ur, vi, zh, zh_hant

source: The Battery Threshold feature lets users save battery by setting a limit at which the app will start saving energy. When the battery drops below this limit, the app updates GPS less often, uses less accurate data, and turns off extra features, which helps save battery life. This means the device can last longer without charging, but the app might not be as accurate or quick. Users can set this limit in the app settings, choosing a value between 40 and 100 percent.
ar: تتيح ميزة حد البطارية للمستخدمين توفير البطارية عن طريق تحديد حد عنده يبدأ التطبيق في توفير الطاقة. عندما تنخفض البطارية تحت هذا الحد، يقلل التطبيق من تحديثات GPS، يستخدم بيانات أقل دقة، ويوقف الميزات الإضافية، مما يساعد في توفير عمر البطارية. هذا يعني أن الجهاز يمكن أن يدوم لفترة أطول دون شحن، ولكن التطبيق قد لا يكون دقيقًا أو سريعًا بنفس القدر. يمكن للمستخدمين تعيين هذا الحد في إعدادات التطبيق، اختيار قيمة بين 40 و100 بالمائة.
bg: Функцията за праг на батерията позволява на потребителите да пестят батерия, като задават лимит, при който приложението ще започне да пести енергия. Когато батерията падне под този лимит, приложението актуализира GPS по-рядко, използва по-малко точни данни и изключва допълнителни функции, което помага за спестяване на батерията. Това означава, че устройството може да издържа по-дълго без зареждане, но приложението може да не е толкова точно или бързо. Потребителите могат да зададат този лимит в настройките на приложението, избирайки стойност между 40 и 100 процента.
bs: Značajka Battery Threshold omogućava korisnicima da uštede bateriju postavljanjem ograničenja na kojem aplikacija počinje štedjeti energiju. Kada baterija padne ispod ovog ograničenja, aplikacija rjeđe ažurira GPS, koristi manje precizne podatke i isključuje dodatne funkcije, što pomaže uštedjeti bateriju. To znači da uređaj može duže trajati bez punjenja, ali aplikacija možda neće biti toliko precizna ili brza. Korisnici mogu postaviti ovo ograničenje u postavkama aplikacije, birajući vrijednost između 40 i 100 posto.
ca: La funció Llindar de la Bateria permet als usuaris estalviar bateria establint un límit a partir del qual l'aplicació començarà a estalviar energia. Quan la bateria cau per sota d'aquest límit, l'aplicació actualitza el GPS amb menys freqüència, utilitza dades menys precises i desactiva funcions addicionals, cosa que ajuda a estalviar bateria. Això significa que el dispositiu pot durar més temps sense carregar, però l'aplicació pot no ser tan precisa ni ràpida. Els usuaris poden establir aquest límit a la configuració de l'aplicació, triant un valor entre el 40 i el 100 per cent.
cs: Funkce Prah Baterie umožňuje uživatelům šetřit baterii nastavením limitu, při kterém aplikace začne šetřit energii. Když baterie klesne pod tento limit, aplikace aktualizuje GPS méně často, používá méně přesná data a vypíná další funkce, což pomáhá šetřit baterii. To znamená, že zařízení může vydržet déle bez nabíjení, ale aplikace nemusí být tak přesná nebo rychlá. Uživatelé mohou nastavit tento limit v nastavení aplikace, volbou hodnoty mezi 40 a 100 procenty.
da: Funktionen Batteritærskel giver brugerne mulighed for at spare batteri ved at indstille en grænse, hvor appen begynder at spare energi. Når batteriet falder under denne grænse, opdaterer appen GPS sjældnere, bruger mindre præcise data og slukker for ekstra funktioner, hvilket hjælper med at spare batterilevetid. Dette betyder, at enheden kan holde længere uden opladning, men appen er måske ikke lige så præcis eller hurtig. Brugerne kan indstille denne grænse i appens indstillinger og vælge en værdi mellem 40 og 100 procent.
de: Die Funktion "Batterielimit" ermöglicht es Benutzern, Akku zu sparen, indem sie ein Limit festlegen, bei dem die App beginnt, Energie zu sparen. Wenn der Akku unter dieses Limit fällt, aktualisiert die App GPS seltener, verwendet weniger genaue Daten und deaktiviert zusätzliche Funktionen, was dabei hilft, Akkulaufzeit zu sparen. Das bedeutet, dass das Gerät länger ohne Aufladen auskommt, aber die App möglicherweise nicht so genau oder schnell ist. Benutzer können dieses Limit in den App-Einstellungen festlegen und einen Wert zwischen 40 und 100 Prozent wählen.
el: Η δυνατότητα Ορίου Μπαταρίας επιτρέπει στους χρήστες να εξοικονομούν μπαταρία ορίζοντας ένα όριο στο οποίο η εφαρμογή θα αρχίσει να εξοικονομεί ενέργεια. Όταν η μπαταρία πέσει κάτω από αυτό το όριο, η εφαρμογή ενημερώνει το GPS λιγότερο συχνά, χρησιμοποιεί λιγότερο ακριβή δεδομένα, και απενεργοποιεί επιπλέον δυνατότητες, βοηθώντας έτσι στην εξοικονόμηση μπαταρίας. Αυτό σημαίνει ότι η συσκευή μπορεί να διαρκέσει περισσότερο χωρίς φόρτιση, αλλά η εφαρμογή μπορεί να μην είναι τόσο ακριβής ή γρήγορη. Οι χρήστες μπορούν να ορίσουν αυτό το όριο στις ρυθμίσεις της εφαρμογής, επιλέγοντας μια τιμή μεταξύ 40 και 100 τοις εκατό.
es: La función Umbral de Batería permite a los usuarios ahorrar batería estableciendo un límite en el cual la aplicación comenzará a ahorrar energía. Cuando la batería cae por debajo de este límite, la aplicación actualiza el GPS con menos frecuencia, utiliza datos menos precisos y desactiva funciones adicionales, lo que ayuda a ahorrar batería. Esto significa que el dispositivo puede durar más tiempo sin cargar, pero la aplicación podría no ser tan precisa o rápida. Los usuarios pueden establecer este límite en la configuración de la aplicación, eligiendo un valor entre el 40 y el 100 por ciento.
et: Aku läve funktsioon võimaldab kasutajatel aku säästa, seades piiri, mille juures rakendus hakkab energiat säästma. Kui aku langeb allapoole seda piiri, uuendab rakendus GPS-i harvemini, kasutab vähem täpseid andmeid ja lülitab välja lisafunktsioonid, mis aitab akut säästa. See tähendab, et seade töötab kauem ilma laadimata, kuid rakendus ei pruugi olla nii täpne või kiire. Kasutajad saavad seada selle piiri rakenduse seadetes, valides väärtuse 40 ja 100 protsendi vahel.
fi: Akkukynnys-toiminnon avulla käyttäjät voivat säästää akkua asettamalla rajan, jossa sovellus alkaa säästää energiaa. Kun akku laskee tämän rajan alle, sovellus päivittää GPS:n harvemmin, käyttää vähemmän tarkkoja tietoja ja poistaa lisäominaisuudet käytöstä, mikä auttaa säästämään akkua. Tämä tarkoittaa, että laite kestää pidempään ilman latausta, mutta sovellus ei ehkä ole yhtä tarkka tai nopea. Käyttäjät voivat asettaa tämän rajan sovelluksen asetuksissa valitsemalla arvon 40 ja 100 prosentin väliltä.
fr: La fonction de seuil de batterie permet aux utilisateurs d'économiser la batterie en définissant une limite à laquelle l'application commencera à économiser de l'énergie. Lorsque la batterie tombe en dessous de cette limite, l'application met à jour le GPS moins souvent, utilise des données moins précises et désactive des fonctionnalités supplémentaires, ce qui aide à économiser la batterie. Cela signifie que l'appareil peut durer plus longtemps sans être chargé, mais que l'application peut ne pas être aussi précise ou rapide. Les utilisateurs peuvent définir cette limite dans les paramètres de l'application, en choisissant une valeur entre 40 et 100 pour cent.
ga: Ligeann gné an Tairsí Ceallra d'úsáideoirí ceallra a shábháil trí theorainn a shocrú ag a dtosóidh an aip fuinneamh a shábháil. Nuair a thiteann an ceallra faoi bhun na teorann seo, déanann an aip GPS a nuashonrú níos lú minic, úsáideann sonraí nach bhfuil chomh cruinn, agus múchann gnéithe breise, rud a chabhraíonn le saol na ceallraí a shábháil. Ciallaíonn sé seo gur féidir leis an bhfeiste maireachtáil níos faide gan luchtú, ach b'fhéidir nach mbeidh an aip chomh cruinn nó chomh tapa. Is féidir le húsáideoirí an teorainn seo a shocrú i suímh an aip, agus luach idir 40 agus 100 faoin gcéad a roghnú.
ga_ie: Ligeann an ghné Teorann Comhartha Ceallraí d’úsáideoirí ceallraí a shábháil trí teorainn a shocrú ag a dtosóidh an aip ag sábháil fuinnimh. Nuair a thiteann an ceallra faoi bhun na teorann seo, nuashonraíonn an aip GPS níos minice, úsáideann sé sonraí níos neamhchruinne agus múchann sé gnéithe breise, rud a chabhraíonn le saolré ceallraí a shábháil. Ciallaíonn sé seo go bhféadfadh an gléas maireachtáil níos faide gan luchtú, ach d’fhéadfadh an aip a bheith níos neamhchruinne nó níos moille. Is féidir le húsáideoirí an teorann seo a shocrú sna socruithe aip, ag roghnú luach idir 40 agus 100 faoin gcéad.
ha: Nunin Batirin Threshold tanadi masu amfani damar ajiye batir ta hanyar saita iyaka da app din zai fara adana makamashi. Idan baturi ya sauka ƙasa da wannan iyaka, app din zai sabunta GPS sau da yawa, amfani da bayanai maras kyau, kuma kashe siffofin kari, wanda ke taimakawa wajen ajiye rayuwar batir. Wannan yana nufin cewa na'urar na iya kasancewa da tsawon lokaci ba tare da caji ba, amma app din bazai iya zama daidai ko sauri ba. Masu amfani za su iya saita wannan iyaka a cikin saitin app din, zabar ƙima tsakanin kashi 40 zuwa 100.
he: תכונת סף הסוללה מאפשרת למשתמשים לחסוך בסוללה על ידי הגדרת גבול בו האפליקציה תתחיל לחסוך באנרגיה. כאשר הסוללה יורדת מתחת לגבול זה, האפליקציה מעדכנת GPS בתדירות נמוכה יותר, משתמשת בנתונים פחות מדויקים ומכבה תכונות נוספות, מה שעוזר לחסוך בסוללה. המשמעות היא שהמכשיר יכול להחזיק זמן רב יותר ללא טעינה, אך האפליקציה עשויה להיות פחות מדויקת או מהירה. משתמשים יכולים להגדיר את הגבול הזה בהגדרות האפליקציה, ובחירה ערך בין 40 ל-100 אחוז.
hi: बैटरी थ्रेशोल्ड फीचर उपयोगकर्ताओं को बैटरी बचाने की अनुमति देता है। जब बैटरी इस सीमा से नीचे चली जाती है, तो ऐप जीपीएस को कम अपडेट करता है, कम सटीक डेटा का उपयोग करता है, और अतिरिक्त फीचर्स को बंद कर देता है, जिससे बैटरी की जीवन अवधि बढ़ जाती है। इसका मतलब है कि डिवाइस बिना चार्ज किए अधिक समय तक चल सकता है, लेकिन ऐप उतना सटीक या तेज नहीं हो सकता। उपयोगकर्ता ऐप सेटिंग्स में इस सीमा को 40 से 100 प्रतिशत के बीच सेट कर सकते हैं।
hr: Značajka Praga Baterije omogućuje korisnicima uštedu baterije postavljanjem ograničenja na kojem će aplikacija početi štedjeti energiju. Kada baterija padne ispod tog ograničenja, aplikacija rjeđe ažurira GPS, koristi manje točne podatke i isključuje dodatne značajke, što pomaže uštedjeti trajanje baterije. To znači da uređaj može dulje trajati bez punjenja, ali aplikacija možda neće biti tako točna ili brza. Korisnici mogu postaviti ovo ograničenje u postavkama aplikacije, birajući vrijednost između 40 i 100 posto.
hu: Az Akkukynnyksen ominosság lehetővé teszi a felhasználók számára, hogy akkumulátort takarítsanak meg egy olyan határ beállításával, amelynél az alkalmazás energiát kezd megtakarítani. Amikor az akkumulátor szintje ezen határ alá csökken, az alkalmazás ritkábban frissíti a GPS-t, kevésbé pontos adatokat használ és kikapcsolja a további funkciókat, ami segít az akkumulátor élettartamának meghosszabbításában. Ez azt jelenti, hogy az eszköz hosszabb ideig bírja töltés nélkül, de az alkalmazás lehet, hogy nem lesz olyan pontos vagy gyors. A felhasználók beállíthatják ezt a határt az alkalmazás beállításaiban, egy 40 és 100 százalék közötti érték kiválasztásával.
hy: «Մարտկոցի սահմանաչափ» հատկությունը թույլ է տալիս օգտվողներին խնայել մարտկոցը՝ սահմանելով մի սահման, որի դեպքում հավելվածը կսկսի խնայել էներգիան: Երբ մարտկոցը իջնում է այդ սահմանից ներքև, հավելվածը ավելի քիչ է թարմացնում GPS-ը, օգտագործում ավելի քիչ ճշգրիտ տվյալներ և անջատում լրացուցիչ ֆունկցիաները, ինչը օգնում է խնայել մարտկոցի կյանքը: Սա նշանակում է, որ սարքը կարող է ավելի երկար աշխատել առանց լիցքավորելու, բայց հավելվածը կարող է չլինել այնքան ճշգրիտ կամ արագ: Օգտվողները կարող են սահմանել այս սահմաը հավելվածի կարգաբերումներում՝ ընտրելով արժեք 40-100 տոկոսի սահմաններում:
id: Fitur Batas Baterai memungkinkan pengguna menghemat baterai dengan menetapkan batas dimana aplikasi akan mulai menghemat energi. Ketika baterai turun di bawah batas ini, aplikasi memperbarui GPS lebih jarang, menggunakan data yang kurang akurat, dan mematikan fitur tambahan, yang membantu menghemat baterai. Ini berarti perangkat bisa bertahan lebih lama tanpa pengisian daya, tetapi aplikasi mungkin tidak seakurat atau secepat biasanya. Pengguna dapat menetapkan batas ini di pengaturan aplikasi, memilih nilai antara 40 hingga 100 persen.
is: Virknin Rafhlöðuþröskuldur leyfir notendum að spara rafhlöðu með því að setja takmörk þar sem forritið byrjar að spara orku. Þegar rafhlaðan fer undir þetta mörk uppfærir forritið GPS sjaldnar, notar óáreiðanlegri gögn og slekkur á aukaaðgerðum, sem hjálpar til við að spara rafhlöðu. Þetta þýðir að tækið getur enst lengur án þess að þurfa hleðslu, en forritið gæti ekki verið eins nákvæmt eða hratt. Notendur geta stillt þetta mörk í forritsstillingum og valið gildi á milli 40 og 100 prósenta.
it: La funzione Soglia della Batteria permette agli utenti di risparmiare batteria impostando un limite al quale l'app inizierà a risparmiare energia. Quando la batteria scende sotto questo limite, l'app aggiorna il GPS meno frequentemente, utilizza dati meno precisi e disattiva funzionalità extra, il che aiuta a risparmiare la durata della batteria. Questo significa che il dispositivo può durare più a lungo senza essere caricato, ma l'app potrebbe non essere altrettanto precisa o veloce. Gli utenti possono impostare questo limite nelle impostazioni dell'app, scegliendo un valore tra il 40 e il 100 percento.
ja: バッテリーしきい値機能により、ユーザーはアプリがエネルギーを節約し始める限界を設定することでバッテリーを節約できます。バッテリーがこの限界を下回ると、アプリはGPSの更新頻度を減らし、データの精度を低下させ、追加機能をオフにしてバッテリー寿命を延ばします。これにより、デバイスは充電なしでより長く使用できますが、アプリの正確性や速度が低下する可能性があります。ユーザーはアプリの設定でこの限界を設定でき、40％から100％の間の値を選択できます。
ka: ბატარეის ზღვრის ფუნქცია მომხმარებლებს საშუალებას აძლევს დაზოგონ ბატარეა, დაადგინონ ზღვარი, როდის დაიწყებს აპი ენერგიის დაზოგვას. როდესაც ბატარეა ამ ზღვრის ქვემოთ ვარდება, აპი უფრო იშვიათად ანახლებს GPS-ს, იყენებს ნაკლებად ზუსტ მონაცემებს და თიშავს დამატებით ფუნქციებს, რაც ეხმარება ბატარეის სიცოცხლის დასაზოგად. ეს ნიშნავს, რომ მოწყობილობა უფრო დიდხანს იმუშავებს დატენვის გარეშე, მაგრამ აპი შესაძლოა არ იყოს ისეთივე ზუსტი ან სწრაფი. მომხმარებლებს შეუძლიათ ეს ზღვარი დააყენონ აპის პარამეტრებში, აირჩიონ 40-დან 100 პროცენტამდე.
ko: 배터리 임계값 기능을 통해 사용자는 앱이 에너지를 절약하기 시작하는 한도를 설정하여 배터리를 절약할 수 있습니다. 배터리가 이 한도 이하로 떨어지면, 앱은 GPS를 덜 자주 업데이트하고 덜 정확한 데이터를 사용하며 추가 기능을 끄게 되어 배터리 수명을 절약합니다. 이는 장치가 충전 없이 더 오래 지속될 수 있음을 의미하지만, 앱이 덜 정확하거나 빠르지 않을 수 있습니다. 사용자는 앱 설정에서 이 한도를 40%에서 100% 사이의 값으로 설정할 수 있습니다.
ku: تایبەتمەندی سنووری باتەری بەکارهێنەران دەیەوە لەکارەبەرەکەی تێکۆشانەوە بە ڕێکخستنی سنوورێک لە کاتێکەدا ئەپەکە دەستی بە پاراستنی هێزی با تەواوی بەرھەمینا دەکا بەرھەم ھێنانەی که. کاتێک با تەری خوارەوەی ئەم سنوورە دابەزێت، ئەپەکە زانیاری جی پی ئێس بە کەمی نوێ دەکات، زانیاری نادروست بەکاردەهێنێتەوە و تایبەتمەندی زیادە دەگرێتەوە، ئەمە بە بەکارهێندەکان یارمەتیدەدات تا ژێرپەڕە بەرھەلمەقەڵ ژمارەی پارامێتەری بەکارهێنەر بەدانەوە لە چوارچێوە ریخست وتەژمارەکان.
la: Functio "Battery Threshold" permittit usoribus servare vim electricam ponendo limitem quo app energiae conservare incipiet. Cum pugna infra hunc limitem cadit, app GPS rarius renovat, minus accurate notitia utitur, et functiones extra exstinguit, quod adiuvat vitam pugnae servare. Hoc significat machinam diutius sine oneratione durare posse, sed app minus accurate vel celeriter esse potest. Usorum potest hunc limitem in app occasibus ponere, eligendo valorem inter 40 et 100 centesimas.
lt: Baterijos ribos funkcija leidžia vartotojams taupyti bateriją nustatant ribą, prie kurios programa pradės taupyti energiją. Kai baterija nukrenta žemiau šios ribos, programa rečiau atnaujina GPS, naudoja mažiau tikslius duomenis ir išjungia papildomas funkcijas, kas padeda taupyti baterijos energiją. Tai reiškia, kad įrenginys gali tarnauti ilgiau be įkrovimo, bet programa gali būti ne tokia tiksli ar greita. Vartotojai gali nustatyti šią ribą programos nustatymuose, pasirinkdami vertę tarp 40 ir 100 procentų.
lv: Akumulatora sliekšņa funkcija ļauj lietotājiem taupīt akumulatoru, nosakot limitu, pie kura lietotne sāks taupīt enerģiju. Kad akumulatora līmenis nokrītas zem šī limita, lietotne retāk atjaunina GPS, izmanto mazāk precīzus datus un izslēdz papildu funkcijas, kas palīdz taupīt akumulatora darbības laiku. Tas nozīmē, ka ierīce var ilgt ilgāk bez uzlādes, taču lietotne var nebūt tik precīza vai ātra. Lietotāji var iestatīt šo limitu lietotnes iestatījumos, izvēloties vērtību no 40 līdz 100 procentiem.
mk: Функцијата Праг на Батеријата им овозможува на корисниците да заштедат батерија со поставување на граница на која апликацијата ќе започне да штеди енергија. Кога батеријата ќе падне под оваа граница, апликацијата поретко го ажурира ГПС-от, користи помалку прецизни податоци и исклучува дополнителни функции, што помага да се заштеди батеријата. Ова значи дека уредот може да трае подолго без полнење, но апликацијата можеби нема да биде толку прецизна или брза. Корисниците можат да ја постават оваа граница во поставките на апликацијата, избирајќи вредност помеѓу 40 и 100 проценти.
ms: Ciri Ambang Bateri membolehkan pengguna menjimatkan bateri dengan menetapkan had di mana aplikasi akan mula menjimatkan tenaga. Apabila bateri jatuh di bawah had ini, aplikasi mengemas kini GPS dengan kurang kerap, menggunakan data yang kurang tepat, dan mematikan ciri tambahan, yang membantu menjimatkan bateri. Ini bermakna peranti boleh bertahan lebih lama tanpa pengecasan, tetapi aplikasi mungkin tidak secepat atau setepat biasa. Pengguna boleh menetapkan had ini dalam tetapan aplikasi, memilih nilai antara 40 dan 100 peratus.
mt: Il-karatteristika tal-Limitu tal-Batterija tippermetti lill-utenti jiffrankaw batterija billi jistabbilixxu limitu fejn l-app tibda tissalvagwardja l-enerġija. Meta l-batterija tinżel taħt dan il-limitu, l-app taġġorna l-GPS inqas spiss, tuża dejta inqas preċiża, u tgħalaq funzjonijiet żejda, li jgħin biex titfaddal il-batterija. Dan ifisser li l-apparat jista' jdum itwal mingħajr iċċarġjar, iżda l-app tista' ma tkunx daqstant preċiża jew veloċi. L-utenti jistgħu jistabbilixxu dan il-limitu fis-settings tal-app, billi jagħżlu valur bejn 40 u 100 fil-mija.
nb: Batteriterskel-funksjonen lar brukerne spare batteri ved å sette en grense ved hvilken appen begynner å spare energi. Når batteriet faller under denne grensen, oppdaterer appen GPS sjeldnere, bruker mindre nøyaktige data, og slår av ekstra funksjoner, noe som hjelper med å spare batterilevetid. Dette betyr at enheten kan vare lengre uten lading, men appen kan være mindre nøyaktig eller rask. Brukerne kan sette denne grensen i appinnstillingene, og velge en verdi mellom 40 og 100 prosent.
nl: De Battery Threshold-functie stelt gebruikers in staat batterij te besparen door een limiet in te stellen waarbij de app zal beginnen met energie besparen. Wanneer de batterij onder deze limiet zakt, werkt de app GPS minder vaak bij, gebruikt het minder nauwkeurige gegevens en schakelt het extra functies uit, wat helpt om de batterijduur te verlengen. Dit betekent dat het apparaat langer kan meegaan zonder opladen, maar de app mogelijk niet zo nauwkeurig of snel is. Gebruikers kunnen deze limiet instellen in de app-instellingen, waarbij ze een waarde tussen 40 en 100 procent kunnen kiezen.
pa: ਬੈਟਰੀ ਥਰੈਸ਼ਹੋਲਡ ਫੀਚਰ ਉਪਭੋਗਤਾਵਾਂ ਨੂੰ ਬੈਟਰੀ ਬਚਾਉਣ ਦੀ ਆਗਿਆ ਦਿੰਦਾ ਹੈ, ਜਿਸ ਨਾਲ ਐਪ ਇਨਰਜੀ ਬਚਾਉਣ ਲਈ ਬੈਟਰੀ ਦੀ ਕਿਸੇ ਖਾਸ ਹੱਦ ਤੇ ਪਹੁੰਚ ਜਾਣ 'ਤੇ ਬਚਾਵ ਕਰਦੀ ਹੈ। ਜਦੋਂ ਬੈਟਰੀ ਇਸ ਹੱਦ ਤੋਂ ਹੇਠਾਂ ਡਿੱਗਦੀ ਹੈ, ਤਾਂ ਐਪ ਜੀ.ਪੀ.ਐੱਸ. ਨੂੰ ਘੱਟ ਅਪਡੇਟ ਕਰਦਾ ਹੈ, ਇੱਕੇ ਦਮ ਉਨ੍ਹਾਂ ਦਾ ਸਹੀ ਸੂਚਨਾ ਵਰਤਦਾ ਹੈ ਅਤੇ ਹੋਰ ਫੀਚਰ ਬੰਦ ਕਰਦਾ ਹੈ, ਜਿਸ ਨਾਲ ਬੈਟਰੀ ਲਾਈਫ ਬਚਾਉਣ ਵਿੱਚ ਮਦਦ ਮਿਲਦੀ ਹੈ। ਇਹ ਮਤਲਬ ਹੈ ਕਿ ਡਿਵਾਈਸ ਬਿਨਾਂ ਚਾਰਜ ਕੀਤੇ ਡਿੰਗਰ ਹੋ ਸਕਦੀ ਹੈ, ਪਰ ਐਪ ਸ਼ਾਇਦ ਇਸ ਨਾਲ ਥੋੜਾ ਘੱਟ ਸਹੀ ਜਾਂ ਤੇਜ਼ ਹੋਵੇ। ਉਪਭੋਗਤਾ ਇਸ ਹੱਦ ਨੂੰ ਐਪ ਸੈਟਿੰਗਵਾਂ ਵਿੱਚ ਸੈਟ ਕਰ ਸਕਦੇ ਹਨ, 40 ਅਤੇ 100 ਪ੍ਰਤੀਸ਼ਤ ਵਿਚਕਾਰ ਕੋਈ ਵੀ ਵੈਲਯੂ ਚੁਣਦੇ ਹੋਏ।
pl: Funkcja Progu Baterii pozwala użytkownikom oszczędzać baterię poprzez ustawienie limitu, przy którym aplikacja zacznie oszczędzać energię. Gdy bateria spadnie poniżej tego limitu, aplikacja rzadziej aktualizuje GPS, używa mniej dokładnych danych i wyłącza dodatkowe funkcje, co pomaga oszczędzać baterię. Oznacza to, że urządzenie może działać dłużej bez ładowania, ale aplikacja może być mniej dokładna lub szybka. Użytkownicy mogą ustawić ten limit w ustawieniach aplikacji, wybierając wartość między 40 a 100 procent.
pt: O recurso Limite de Bateria permite aos usuários economizar bateria definindo um limite a partir do qual o aplicativo começará a economizar energia. Quando a bateria cai abaixo desse limite, o aplicativo atualiza o GPS com menos frequência, usa dados menos precisos e desativa recursos extras, o que ajuda a economizar bateria. Isso significa que o dispositivo pode durar mais tempo sem carregar, mas o aplicativo pode não ser tão preciso ou rápido. Os usuários podem definir esse limite nas configurações do aplicativo, escolhendo um valor entre 40 e 100 por cento.
pt_pt: A funcionalidade Limite de Bateria permite que os utilizadores poupem bateria definindo um limite a partir do qual a aplicação começará a economizar energia. Quando a bateria desce abaixo desse limite, a aplicação atualiza o GPS com menos frequência, utiliza dados menos precisos e desativa funcionalidades adicionais, o que ajuda a poupar a vida útil da bateria. Isto significa que o dispositivo pode durar mais tempo sem carregar, mas a aplicação pode não ser tão precisa ou rápida. Os utilizadores podem definir este limite nas configurações da aplicação, escolhendo um valor entre 40 e 100 por cento.
qu: La función de Umbral de Batería permite a los usuarios ahorrar batería estableciendo un límite en el cual la aplicación comenzará a ahorrar energía. Cuando la batería cae por debajo de este límite, la aplicación actualiza el GPS con menos frecuencia, usa datos menos precisos y desactiva funciones adicionales para ayudar a ahorrar batería. Esto significa que el dispositivo puede durar más tiempo sin cargar, pero la aplicación podría no ser tan precisa o rápida. Los usuarios pueden establecer este límite en los ajustes de la aplicación, eligiendo un valor entre el 40 y el 100 por ciento.
rm: La funcziun Battery Threshold lubescha als utilisaders da spargnar la battaria cun fixar in limit a partir dal qual l'app entschaiva a spargnar energia. Cura che la battaria croda sut quest limit, l'app actualisescha il GPS main savens, dovra datas main precisas e deactivescha funcziuns supplementaras, quai che gida a spargnar la battaria. Quai signifitga che il dispositiv po durer pli ditg senza chargiar, ma l'app pudess esser main precisa u pli plauna. Ils utilisaders pon fixar quest limit en las opziuns da l'app, tscherna in valor tranter 40 e 100 pertschient.
rm_ch: La funzione Battery Threshold lubescha als utilisaders da spargnar battaria cun metter in limit, a partir dal qual l'app entschaiva a spargnar energia. Cura che la battaria croda sut quest limit, l'app actualisescha il GPS main savens, utilisescha datas main exactas e disattiva funcziuns supplementaras, quai che gidia a spargnar battaria. Quai signifitga che il dispositiv po tegnair pli ditg senza chargiar, ma l'app pudess esser main exacta u pli plauna. Ils utilisaders pon metter quest limit en las setgas da l'app, tschernind in valur tranter 40 e 100 pertschient.
ro: Funcția Prag Baterie permite utilizatorilor să economisească baterie stabilind o limită la care aplicația va începe să economisească energie. Când bateria scade sub această limită, aplicația actualizează GPS-ul mai rar, folosește date mai puțin precise și dezactivează funcțiile suplimentare, ceea ce ajută la economisirea bateriei. Acest lucru înseamnă că dispozitivul poate rezista mai mult timp fără încărcare, dar aplicația ar putea să nu fie la fel de precisă sau rapidă. Utilizatorii pot stabili această limită în setările aplicației, alegând o valoare între 40 și 100 la sută.
ru: Функция порога аккумулятора позволяет пользователям экономить заряд, установив предел, при котором приложение начнет экономить энергию. Когда заряд опускается ниже этого предела, приложение реже обновляет GPS, использует менее точные данные и отключает дополнительные функции, что помогает сэкономить заряд. Это значит, что устройство может работать дольше без подзарядки, но приложение может быть менее точным или быстрым. Пользователи могут задать этот предел в настройках приложения, выбирая значение от 40 до 100 процентов.
sk: Funkcia Práh Batérie umožňuje užívateľom šetriť batériu nastavením limitu, pri ktorom aplikácia začne šetriť energiu. Keď batéria klesne pod tento limit, aplikácia aktualizuje GPS menej často, používa menej presné údaje a vypne ďalšie funkcie, čo pomáha šetriť životnosť batérie. To znamená, že zariadenie môže vydržať dlhšie bez nabíjania, ale aplikácia nemusí byť taká presná alebo rýchla. Užívatelia môžu tento limit nastaviť v nastaveniach aplikácie, pričom si môžu vybrať hodnotu medzi 40 a 100 percentami.
sl: Funkcija Praga Baterije uporabnikom omogoča varčevanje z baterijo z nastavitvijo meje, pri kateri bo aplikacija začela varčevati z energijo. Ko baterija pade pod to mejo, aplikacija manj pogosto posodablja GPS, uporablja manj natančne podatke in izklopi dodatne funkcije, kar pomaga prihraniti baterijo. To pomeni, da naprava zdrži dlje brez polnjenja, vendar aplikacija morda ne bo tako natančna ali hitra. Uporabniki lahko to mejo nastavijo v nastavitvah aplikacije, z izbiranjem vrednosti med 40 in 100 odstotki.
sq: Funksioni i Pragut të Baterisë lejon përdoruesit të kursejnë baterinë duke caktuar një kufi në të cilin aplikacioni do të fillojë të kursejë energji. Kur bateria bie nën këtë kufi, aplikacioni përditëson GPS-në më rrallë, përdor të dhëna më pak të sakta dhe fik funksione shtesë, gjë që ndihmon në kursimin e jetës së baterisë. Kjo do të thotë që pajisja mund të zgjasë më shumë pa u karikuar, por aplikacioni mund të mos jetë aq i saktë ose i shpejtë. Përdoruesit mund të caktojnë këtë kufi në cilësimet e aplikacionit, duke zgjedhur një vlerë midis 40 dhe 100 përqind.
sr: Funkcija Battery Threshold omogućava korisnicima da čuvaju bateriju postavljanjem ograničenja pri kojem će aplikacija početi štedeti energiju. Kada baterija padne ispod ovog ograničenja, aplikacija ređe ažurira GPS, koristi manje tačne podatke i isključuje dodatne funkcije, što pomaže uštedeti bateriju. To znači da uređaj može duže trajati bez punjenja, ali aplikacija možda neće biti tako tačna ili brza. Korisnici mogu postaviti ovo ograničenje u postavkama aplikacije, birajući vrednost između 40 i 100 procenata.
sv: Funktion Batteritröskel gör att användare kan spara batteri genom att ställa in en gräns vid vilken appen kommer att börja spara energi. När batteriet sjunker under denna gräns uppdaterar appen GPS mer sällan, använder mindre noggrann data och stänger av extra funktioner, vilket hjälper till att spara batteri. Detta innebär att enheten kan hålla längre utan att laddas, men appen kanske inte är lika exakt eller snabb. Användare kan ställa in denna gräns i appens inställningar och välja ett värde mellan 40 och 100 procent.
sw: Kipengele cha Kizingiti cha Betri huruhusu watumiaji kuokoa betri kwa kuweka kikomo ambapo programu itaanza kuokoa nishati. Betri ikishuka chini ya kikomo hiki, programu husasisha GPS kidogo, hutumia data isiyo sahihi zaidi, na kuzima vipengele vya ziada, ambavyo husaidia kuokoa betri. Hii inamaanisha kifaa kinaweza kudumu zaidi bila kuchajiwa, lakini programu inaweza isiwe sahihi au ya haraka. Watumiaji wanaweza kuweka kikomo hiki katika mipangilio ya programu, wakichagua thamani kati ya asilimia 40 na 100.
th: ฟีเจอร์ขีดจำกัดแบตเตอรี่ให้ผู้ใช้ประหยัดแบตเตอรี่ โดยตั้งค่าขีดจำกัดที่แอปจะเริ่มประหยัดพลังงาน เมื่อแบตเตอรี่ลดลงต่ำกว่าขีดจำกัดนี้ แอปจะอัปเดต GPS น้อยลง ใช้ข้อมูลที่แม่นยำน้อยลง และปิดฟีเจอร์เสริม ช่วยให้ประหยัดแบตเตอรี่ อุปกรณ์สามารถใช้งานได้นานขึ้นโดยไม่ต้องชาร์จ แต่แอปอาจไม่แม่นยำหรือรวดเร็ว ผู้ใช้สามารถตั้งค่าขีดจำกัดนี้ในการตั้งค่าแอป โดยเลือกค่าระหว่าง 40 ถึง 100 เปอร์เซ็นต์
tr: Battery Threshold özelliği, kullanıcıların uygulamanın enerji tasarrufu yapmaya başlayacağı bir sınır belirleyerek pil tasarrufu yapmalarını sağlar. Pil bu sınırın altına düştüğünde, uygulama GPS'i daha az günceller, daha az doğru veriler kullanır ve ekstra özellikleri kapatır, bu da pil ömrünü uzatır. Bu, cihazın şarj etmeksizin daha uzun süre dayanabileceği anlamına gelir, ancak uygulama o kadar doğru veya hızlı olmayabilir. Kullanıcılar bu sınırı uygulama ayarlarında belirleyebilir, 40 ile 100 arasında bir değer seçerek.
uk_ua: Функція порогу батареї дозволяє користувачам економити заряд батареї, встановлюючи межу, при якій додаток почне заощаджувати енергію. Коли батарея падає нижче цієї межі, додаток рідше оновлює GPS, використовує менш точні дані і вимикає додаткові функції, що допомагає зберегти заряд. Це означає, що пристрій може працювати довше без зарядки, але додаток може бути менш точним або більш повільним. Користувачі можуть встановити цю межу в налаштуваннях додатка, вибравши значення між 40 і 100 відсотками.
ur: بیٹری تھریش ہولڈ فیچر صارفین کو بیٹری بچانے کی اجازت دیتا ہے جس میں محدود سیٹ کی جاتی ہے جس پر ایپ توانائی بچانا شروع کر دیتی ہے۔ جب بیٹری اس حد سے کم ہوتی ہے، ایپ GPS کم اپ ڈیٹ کرتی ہے، کم درست ڈیٹا استعمال کرتی ہے، اور اضافی خصوصیات بند کر دیتی ہے، جو بیٹری زندگی بچانے میں مدد دیتی ہے۔ اس کا مطلب ہے کہ ڈیوائس چارج کیے بغیر زیادہ دیر تک کارآمد ہو سکتی ہے، مگر ایپ اتنی صحیح یا تیز نہیں ہوگی۔ صارفین ایپ سیٹنگز میں یہ حد سیٹ کر سکتے ہیں، 40 تا 100 فیصد کے درمیان کوئی بھی ویلیو منتخب کر سکتے ہیں۔
vi: Tính năng Giới hạn Pin cho phép người dùng tiết kiệm pin bằng cách đặt giới hạn mà tại đó ứng dụng sẽ bắt đầu tiết kiệm năng lượng. Khi pin giảm dưới giới hạn này, ứng dụng sẽ cập nhật GPS ít thường xuyên hơn, sử dụng dữ liệu kém chính xác hơn và tắt các tính năng bổ sung, giúp tiết kiệm pin. Điều này có nghĩa là thiết bị có thể kéo dài thời gian sử dụng mà không cần sạc, nhưng ứng dụng có thể không chính xác hoặc nhanh nhạy như trước. Người dùng có thể đặt giới hạn này trong cài đặt ứng dụng, chọn giá trị từ 40 đến 100 phần trăm.
zh: 电池阈值功能使用户通过设置一个限制来节省电池，当电池电量低于此限制时，应用程序将启动节能模式。 当电池跌破该限制时，应用程序会减少GPS更新频率，使用不太精确的数据，并关闭额外功能，从而帮助节省电池寿命。 这意味着设备可以更长时间不充电，但应用程序可能不如平时准确或快速。 用户可以在应用程序设置中设置此限制，选择一个在40%到100%之间的值。
zh_hant: 電池閾值功能使用戶能通過設置應用程式開始節約能量的限制來節省電池。當電池降到此限制以下時，應用程式將降低GPS更新頻率，使用較不精確的數據，並關閉額外功能，以節省電池電量。這意味著設備在不充電的情況下可以使用更長時間，但應用程式可能不那麼精確或快速。用戶可以在應用程式設置中設置此限制，選擇40到100百分比之間的數值。
